bmTest03Try/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xMin //inlet      
    {
        type            zeroGradient;
    }
    xMax //outlet    
    {
        type            fixedValue;
        value           uniform 0;
    }
    yMin      
    {
        type            zeroGradient;
    }
    yMax      
    {
        type            zeroGradient;
    }
    zMin      
    {
        type            cyclic;
    }
    zMax    
    {
        type            cyclic;
    }
    cylinder      
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
